redis_benchmark/test/withKubearmor1_1000000.txt
====== GET ======
  1000000 requests completed in 12.01 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 900 1 300 10 60 10000
  host configuration "appendonly": yes
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.127 milliseconds (cumulative count 1)
50.000% <= 0.303 milliseconds (cumulative count 729420)
75.000% <= 0.311 milliseconds (cumulative count 842713)
87.500% <= 0.319 milliseconds (cumulative count 882657)
93.750% <= 0.367 milliseconds (cumulative count 938805)
96.875% <= 0.431 milliseconds (cumulative count 972333)
98.438% <= 0.479 milliseconds (cumulative count 985353)
99.219% <= 0.607 milliseconds (cumulative count 992487)
99.609% <= 0.751 milliseconds (cumulative count 996115)
99.805% <= 0.863 milliseconds (cumulative count 998068)
99.902% <= 1.015 milliseconds (cumulative count 999028)
99.951% <= 1.167 milliseconds (cumulative count 999537)
99.976% <= 1.335 milliseconds (cumulative count 999759)
99.988% <= 1.711 milliseconds (cumulative count 999878)
99.994% <= 2.503 milliseconds (cumulative count 999939)
99.997% <= 2.967 milliseconds (cumulative count 999970)
99.998% <= 3.239 milliseconds (cumulative count 999985)
99.999% <= 3.439 milliseconds (cumulative count 999993)
100.000% <= 3.543 milliseconds (cumulative count 999997)
100.000% <= 3.583 milliseconds (cumulative count 999999)
100.000% <= 3.623 milliseconds (cumulative count 1000000)
100.000% <= 3.623 milliseconds (cumulative count 1000000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.004% <= 0.207 milliseconds (cumulative count 39)
72.942% <= 0.303 milliseconds (cumulative count 729420)
95.918% <= 0.407 milliseconds (cumulative count 959182)
98.679% <= 0.503 milliseconds (cumulative count 986786)
99.249% <= 0.607 milliseconds (cumulative count 992487)
99.557% <= 0.703 milliseconds (cumulative count 995567)
99.734% <= 0.807 milliseconds (cumulative count 997337)
99.846% <= 0.903 milliseconds (cumulative count 998461)
99.898% <= 1.007 milliseconds (cumulative count 998984)
99.941% <= 1.103 milliseconds (cumulative count 999409)
99.956% <= 1.207 milliseconds (cumulative count 999564)
99.971% <= 1.303 milliseconds (cumulative count 999713)
99.981% <= 1.407 milliseconds (cumulative count 999812)
99.986% <= 1.503 milliseconds (cumulative count 999860)
99.987% <= 1.607 milliseconds (cumulative count 999866)
99.988% <= 1.703 milliseconds (cumulative count 999877)
99.989% <= 1.807 milliseconds (cumulative count 999891)
99.990% <= 1.903 milliseconds (cumulative count 999901)
99.991% <= 2.007 milliseconds (cumulative count 999914)
99.992% <= 2.103 milliseconds (cumulative count 999920)
99.998% <= 3.103 milliseconds (cumulative count 999978)
100.000% <= 4.103 milliseconds (cumulative count 1000000)

Summary:
  throughput summary: 83257.02 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        0.309     0.120     0.303     0.391     0.567     3.623