redis_benchmark/test/withKubearmor3_1000000.txt
====== GET ======
  1000000 requests completed in 0.57 seconds
  1000 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": no
  multi-thread: no

Latency by percentile distribution:
0.000% <= 30.159 milliseconds (cumulative count 1000)
50.000% <= 248.703 milliseconds (cumulative count 501000)
75.000% <= 267.519 milliseconds (cumulative count 751000)
87.500% <= 277.247 milliseconds (cumulative count 876000)
93.750% <= 281.343 milliseconds (cumulative count 938000)
96.875% <= 285.439 milliseconds (cumulative count 972000)
98.438% <= 286.463 milliseconds (cumulative count 988000)
99.219% <= 286.975 milliseconds (cumulative count 996000)
99.609% <= 287.231 milliseconds (cumulative count 998000)
99.805% <= 292.095 milliseconds (cumulative count 1000000)
100.000% <= 292.095 milliseconds (cumulative count 1000000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
1.400% <= 31.103 milliseconds (cumulative count 14000)
3.500% <= 32.111 milliseconds (cumulative count 35000)
5.600% <= 33.119 milliseconds (cumulative count 56000)
7.200% <= 34.111 milliseconds (cumulative count 72000)
8.800% <= 35.103 milliseconds (cumulative count 88000)
10.300% <= 36.127 milliseconds (cumulative count 103000)
10.900% <= 37.119 milliseconds (cumulative count 109000)
12.400% <= 222.207 milliseconds (cumulative count 124000)
13.800% <= 223.103 milliseconds (cumulative count 138000)
15.300% <= 224.127 milliseconds (cumulative count 153000)
16.900% <= 225.151 milliseconds (cumulative count 169000)
18.500% <= 226.175 milliseconds (cumulative count 185000)
19.800% <= 227.199 milliseconds (cumulative count 198000)
21.300% <= 228.223 milliseconds (cumulative count 213000)
22.100% <= 229.119 milliseconds (cumulative count 221000)
23.700% <= 230.143 milliseconds (cumulative count 237000)
25.300% <= 231.167 milliseconds (cumulative count 253000)
26.900% <= 232.191 milliseconds (cumulative count 269000)
28.100% <= 233.215 milliseconds (cumulative count 281000)
29.300% <= 234.111 milliseconds (cumulative count 293000)
30.600% <= 235.135 milliseconds (cumulative count 306000)
31.900% <= 236.159 milliseconds (cumulative count 319000)
33.300% <= 237.183 milliseconds (cumulative count 333000)
34.100% <= 238.207 milliseconds (cumulative count 341000)
35.500% <= 239.103 milliseconds (cumulative count 355000)
37.100% <= 240.127 milliseconds (cumulative count 371000)
38.700% <= 241.151 milliseconds (cumulative count 387000)
40.300% <= 242.175 milliseconds (cumulative count 403000)
41.800% <= 243.199 milliseconds (cumulative count 418000)
43.500% <= 244.223 milliseconds (cumulative count 435000)
44.800% <= 245.119 milliseconds (cumulative count 448000)
46.400% <= 246.143 milliseconds (cumulative count 464000)
48.000% <= 247.167 milliseconds (cumulative count 480000)
49.300% <= 248.191 milliseconds (cumulative count 493000)
50.900% <= 249.215 milliseconds (cumulative count 509000)
52.300% <= 250.111 milliseconds (cumulative count 523000)
53.800% <= 251.135 milliseconds (cumulative count 538000)
54.800% <= 254.207 milliseconds (cumulative count 548000)
56.000% <= 255.103 milliseconds (cumulative count 560000)
57.600% <= 256.127 milliseconds (cumulative count 576000)
59.100% <= 257.151 milliseconds (cumulative count 591000)
60.800% <= 258.175 milliseconds (cumulative count 608000)
62.400% <= 259.199 milliseconds (cumulative count 624000)
64.000% <= 260.223 milliseconds (cumulative count 640000)
65.400% <= 261.119 milliseconds (cumulative count 654000)
66.900% <= 262.143 milliseconds (cumulative count 669000)
68.400% <= 263.167 milliseconds (cumulative count 684000)
70.000% <= 264.191 milliseconds (cumulative count 700000)
71.500% <= 265.215 milliseconds (cumulative count 715000)
73.100% <= 266.239 milliseconds (cumulative count 731000)
74.700% <= 267.263 milliseconds (cumulative count 747000)
76.300% <= 268.287 milliseconds (cumulative count 763000)
77.900% <= 269.311 milliseconds (cumulative count 779000)
79.500% <= 270.335 milliseconds (cumulative count 795000)
80.700% <= 271.103 milliseconds (cumulative count 807000)
82.300% <= 272.127 milliseconds (cumulative count 823000)
83.900% <= 273.151 milliseconds (cumulative count 839000)
85.300% <= 274.175 milliseconds (cumulative count 853000)
85.400% <= 275.199 milliseconds (cumulative count 854000)
86.300% <= 276.223 milliseconds (cumulative count 863000)
87.600% <= 277.247 milliseconds (cumulative count 876000)
89.100% <= 278.271 milliseconds (cumulative count 891000)
90.700% <= 279.295 milliseconds (cumulative count 907000)
92.300% <= 280.319 milliseconds (cumulative count 923000)
93.800% <= 281.343 milliseconds (cumulative count 938000)
94.900% <= 282.111 milliseconds (cumulative count 949000)
95.700% <= 283.135 milliseconds (cumulative count 957000)
96.800% <= 285.183 milliseconds (cumulative count 968000)
98.400% <= 286.207 milliseconds (cumulative count 984000)
99.800% <= 287.231 milliseconds (cumulative count 998000)
100.000% <= 292.351 milliseconds (cumulative count 1000000)

Summary:
  throughput summary: 1766784.50 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
      229.447    30.144   248.703   282.367   286.719   292.095